{
    "homePage_001": "Green planet building a set of global consensus on Oasis cause",
    "homePage_002": "And financial infrastructure to serve for desertification control and greening.",
    "homePage_003": "Introduce to green planet -",
    "homePage_004": "Green planet uses blockchain technology to standardize the public welfare of desertification control and planting, to create an open green desertification control public welfare platform that everyone can participate in, and everyone is responsible for desertification control and planting, which can make profits and do public welfare behaviors. So far, it is one of the few public welfare activities in the world that can achieve both returns and kindness.",
    "homePage_005": "Drive the global green cause",
    "homePage_006": "We call on more people of insight to pay attention to the problem of desertification, join in the ranks of the problem of combating desertification, drive a group of people to do one thing and achieve a great green cause.",
    "homePage_007": "Building a global green cause",
    "homePage_008": "Build an autonomous green ecology, let more people participate in the global green cause, let participants also get incentives, let participants share wealth, let builders win-win in the future, and let developers coexist.",
    "homePage_009": "Greening management",
    "homePage_010": "Turn the desert into an oasis, plant more trees, control more land, turn barren mountains into oases, and contribute a 'green card' to the global desert area. Strive to improve human ecological environment .",
    "homePage_011": "Character -",
    "homePage_012": "Light weight",
    "homePage_013": "The end users of green planet do not need to download the blockchain, which is ready to use.",
    "homePage_014": "Elastic",
    "homePage_015": "Green planet can expand convenient plug-in development and third-party access architecture.",
    "homePage_016": "Efficient",
    "homePage_017": "Based on graphene engine, it has second level confirmation time and strong carrying capacity, which brings users a good platform experience.",
    "homePage_018": "Facilitate",
    "homePage_019": "Support web, mobile app and other clients, which can be used and managed in mobile phones and computers (love value: NAI), greatly facilitating customers.",
    "homePage_020": "Participate in",
    "homePage_021": "Everyone is responsible for sand control and tree planting, which can make profits and do public welfare activities, so that every customer has a strong sense of participation.",
    "homePage_022": "Greening mission consensus",
    "homePage_023": "By connecting digital assets with the global desert real economy, green planet enables everyone to contribute their public value through the green planet platform and benefit from rewards in the form of love value. Let the world embrace the blue sky, give the earth a forest sea, return the human green home, let the participants share the wealth, let the builders win-win in the future, let the pioneers coexist.",
    "homePage_024": "Mutual benefit",
    "homePage_025": "With the long-term development strategy of global people's support, everyone's participation and everyone's benefit, the green planet public welfare mutual assistance platform actively promotes the correct understanding and attention of the public on desert governance, and promotes the social forces from all walks of life to actively participate in the green cause of desertification control. To realize the participation of all people in the prevention and control of desertification and the sharing of construction achievements, it is more important to let human beings re understand and utilize deserts, and bring more possibilities and hopes for more deserts and oases in the world.",
    "homePage_026": "Technical features -",
    "homePage_027": "Green planet is based on the current situation of the blockchain of global green desert public welfare. It is difficult to only use the blockchain technology to ensure the implementation of the global green desert public welfare industry and realize the technology enabling industry. Based on this, Nai starts from the reality and does not blindly use all technologies of blockchain.",
    "homePage_028": "Based on IPFs / storj / Cloud Service",
    "homePage_029": "Enterprise management cloud platform for big data and AI.",
    "homePage_030": "Intelligent hardware layer",
    "homePage_031": "Enterprise class baas platform",
    "homePage_032": "Team",
    "homePage_033": "CEO",
    "homePage_034": "Paul WALTHER",
    "homePage_035": "Paul WALTHER He is the initiator and CEO of Nai project, responsible for product and business work.",
    "homePage_036": "Market leader",
    "homePage_037": "Carl REVILLIOD",
    "homePage_038": "Carl REVILLIOD Be responsible for brand positioning, packaging, design, planning and marketing of Nai and green desert public welfare products in Nai project, and continuously improve user experience.",
    "homePage_039": "Blockchain related technology development",
    "homePage_040": "Howard Sands",
    "homePage_041": "Technology development includes point-to-point network design, encryption technology application, distributed algorithm implementation, data storage technology, etc.",
    "homePage_042": "CFO",
    "homePage_043": "Alle Olumets",
    "homePage_044": "American. More than six years of financial planning and analysis experience in medium-sized and above enterprises, and more than four years of financial management experience in financial industry.",
    "homePage_045": "Product Development",
    "homePage_046": "Julien CLARET",
    "homePage_047": "Responsible for the development, construction, daily maintenance and update of the mall products. Proficient in SQL server and other database technology.",
    "homePage_048": "Development -",
    "homePage_049": "Cooperation",
    "homePage_050": "Green planet has reached in-depth strategic cooperation with a number of overseas investment institutions, bringing new ideas and imagination space for the development of green planet platform.",
    "homePage_051": "Open public welfare research on tree planting and desertification control",
    "homePage_052": "Complete the feasibility study report of tree planting and sand control",
    "homePage_053": "Open Market Research of green ecological industry",
    "homePage_054": "Complete market research of green ecological industry",
    "homePage_055": "Complete the concept white paper and launch the official website of the project",
    "homePage_056": "Complete platform basic function development and mobile client test version",
    "homePage_057": "Complete the underlying technology development of blockchain",
    "homePage_058": "Gradually establish the ecological community of love value application scenario and build a multi-faceted industrial chain application of global tourism industry chain",
    "homePage_059": "Improve the underlying technology development of blockchain",
    "homePage_060": "On the main network, the public chain reduces production by half every two years, and the smart contract is opened for voting"
}